# Часть 1. Теория
# 1. интерпретируемый язык кросс платформленный, а комбилируемый зависит от платформы
# интерпретируемого это тот кто изпользует интопретатор
# 2.Типы данных нужны lдля того чтобы программа понимала с какими значениями она может взаимодействовать
z=10
print(int(z))
print(float(z))
print(str(z))
print(bool(z))
x="Hello"
# print(int(x))
# 3. = это просто что либо присвоить допустм присвоить к переменной какоу либо значение "z=10", =+ это вроде бы добавить
# к значению ещё что либо "z+=1" получиться "z=11"
# 4. функция round округляет значение "z=1.123, round(z,2)" получиться 1.12, функция abs() возводит значение в модулью
# 5. терминал это поле существующее в компьютере в котором можно писать какие либо программы
# 6. для терминала, чтобы управлять пакетами
# Часть 2. Практика
# 1.
# x=input('Введите пятизначное число: ')
# x=int(x)
# print(x//10000)
# print(x%10)
# q=x//10000
# w=x//1000%10
# e=x//100%10
# r=x//10%10
# t=x%10
# # print(q,w,e,r,t)
# print(q+w+e+r+t)
# # 2.
# x=8
# x+=12
# # print(x)
# x=x//4
# x=x**2
# print(x)
# 3.
c=input('Введите дрорбное число: ')
c=float(c)
abs(c)
c=round(c, 0)
# c=int(c)
print(c)
# Часть 3. Терминал
# 1. слева написано(С:...)
# 2. dir
# 3. pip install requests
# 4. cd ..\Desctop
