# z=input("Введите трехзначное число: ")
# z=int(z)
# x=z//100
# c=z//10%10
# v=z%10
# print(x, c, v)
# print(v*100+c*10+x)

# z=input('Введите сколько литров раствора в бочке: ')
# z=int(z)
# x=z//3
# c=z%3
# x=int(x)
# c=int(c)
# print(x,"заходов мы совершили,", c, 'осталось в бочке') 

# v=input("Введите V : ")
# s=input("Введите S : ")
# v=int(v)
# s=int(s)
# print("V=", v, "км/ч, S=", s, "км. Найтиде t")
# t=s/v
# print("Машина проедет это растояние за", t, "часа")

x1=input("Введите х1: ")
x2=input("Введите х2: ")
x1=float(x1)
x2=float(x2)
print(abs(x1-x2))
